
## Plan Result (aat)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.more_viewers-grafana9[0]
  * azurerm_role_assignment.viewers-grafana9[0]
* Update
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.more_viewers-grafana9[0] will be created
  + resource "azurerm_role_assignment" "more_viewers-grafana9" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d0f6d0b1-d067-40ac-80b4-2ec5bc5fd817"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.viewers-grafana9[0] will be created
  + resource "azurerm_role_assignment" "viewers-grafana9" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98bbe6e9-2878-4bc6-b602-30ad18b6e934"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":167,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->